1s/ERP/Conf/Catalogs/Лико_ПравилаПодписиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаПодписиДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаПодписиДокументов/Ext/ManagerModule.bsl
Функция ОпределитьПравило(Организация,Номенклатура,ДокументРасхода=Неопределено,Количество=0,КоличествоУпаковок=0) Экспорт
Если ДокументРасхода=Неопределено Тогда
		ДокументСписания=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
	КонецЕсли;
	СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
		Запрос.УстановитьПараметр("Организация",Организация);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Если Выборка.СложнаяНастройка Тогда 
		ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Номенклатура,ДокументРасхода,Количество,КоличествоУпаковок);		
			
		Иначе
			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
					Структура = Новый Структура;
					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
					Структура.Вставить("Значение",ДопРеквизит.Значение);
					НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь;
						Прервать;
					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь; 
						Прервать;				
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
		Если ИспользоватьЭтоПравило Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;			
		
	КонецЦикла;
	

КонецФункции


Функция ТекстЗапросаПравилПоВидуНоменклатуры()
	
	Возврат 
	"ВЫБРАТЬ
	|	Лико_ПравилаПодписиДокументов.Ссылка КАК Ссылка,
	|	Лико_ПравилаПодписиДокументов.ВерсияДанных КАК ВерсияДанных,
	|	Лико_ПравилаПодписиДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	Лико_ПравилаПодписиДокументов.Код КАК Код,
	|	Лико_ПравилаПодписиДокументов.Наименование КАК Наименование,
	|	Лико_ПравилаПодписиДокументов.Выключить КАК Выключить,
	|	Лико_ПравилаПодписиДокументов.Организация КАК Организация,
	|	Лико_ПравилаПодписиДокументов.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Лико_ПравилаПодписиДокументов.Описание КАК Описание,
	|	Лико_ПравилаПодписиДокументов.Предопределенный КАК Предопределенный,
	|	Лико_ПравилаПодписиДокументов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Лико_ПравилаПодписиДокументов.СложнаяНастройка КАК СложнаяНастройка,
	|	Лико_ПравилаПодписиДокументов.ОтборНастройки КАК ОтборНастройки,
	|	Лико_ПравилаПодписиДокументов.Приоритет КАК Приоритет
	|ИЗ
	|	Справочник.Лико_ПравилаПодписиДокументов КАК Лико_ПравилаПодписиДокументов
	|ГДЕ
	|	Лико_ПравилаПодписиДокументов.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ Лико_ПравилаПодписиДокументов.ПометкаУдаления
	|	И НЕ Лико_ПравилаПодписиДокументов.Выключить
	|	И Лико_ПравилаПодписиДокументов.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
КонецФункции



Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры


Функция ИспользоватьПравилоСКД(Выборка,Номенклатура,ДокументРасхода,Количество,КоличествоУпаковок) //+Лико m.shenderov 30.12.2018
	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
    СхемаКомпоновкиДанных = Справочники.Лико_ПравилаПодписиДокументов.ПолучитьМакет("ОтборПоУсловию");
	//URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
   ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
   ОтборНастройки.Инициализировать(ИсточникНастроек);
   	ТекНастройки = Выборка.ОтборНастройки.Получить();
	
	Если ТекНастройки = Неопределено Тогда
		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборНастройки.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
    УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Номенклатура" , Номенклатура);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "ДокументРасхода", ДокументРасхода);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Количество", Количество);
УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "КоличествоУпаковок", КоличествоУпаковок);


	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

	Если 	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 	
КонецФункции //-Лико m.shenderov 30.12.2018 













Функция ПолучитьПриоритетМакс(ВидНоменклатуры) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_ПравилаПодписиДокументов.Приоритет) КАК Приоритет
	|ИЗ
	|	Справочник.Лико_ПравилаПодписиДокументов КАК Лико_ПравилаПодписиДокументов
	|ГДЕ
	|	Лико_ПравилаПодписиДокументов.ВидНоменклатуры = &ВидНоменклатуры";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	Если ЗначениеЗаполнено(Выборка.Приоритет) Тогда
		Возврат Выборка.Приоритет;
	КонецЕсли;
	
	КонецЦикла; 
	
	Возврат 0;	
КонецФункции //-Лико m.shenderov 28.12.2018 

Процедура ПереместитьПоПриоритету(Ссылка,Шаг) Экспорт 
	
	
	ТекущийПриоритет	=	Ссылка.Приоритет;
	НовыйПриоритет		=	ТекущийПриоритет+Шаг;
	
	Если НовыйПриоритет=0 Или НовыйПриоритет=ПолучитьПриоритетМакс(Ссылка.ВидНоменклатуры)+1 Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонкурент=ПолучитьПравилоПоПриоритету(Ссылка.ВидНоменклатуры,НовыйПриоритет);
	
	НачатьТранзакцию();
	
	СправочникОбъект			=Ссылка.ПолучитьОбъект();
	СправочникОбъект.Приоритет	=НовыйПриоритет; 	
	СправочникОбъект.Записать();
	Если ЗначениеЗаполнено(ПравилоКонкурент) Тогда
		
		СправочникОбъект			 =ПравилоКонкурент.ПолучитьОбъект();
		СправочникОбъект.Приоритет	 =СправочникОбъект.Приоритет-Шаг; 	
		СправочникОбъект.Записать();
	КонецЕсли;
	
	
	
	
	ЗафиксироватьТранзакцию();
	
	
	
КонецПроцедуры //-Лико m.shenderov 28.12.2018

Функция ПолучитьПравилоПоПриоритету(ВидНоменклатуры,Приоритет) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка ИЗ Справочник.Лико_ПравилаПодписиДокументов КАК Док
	|ГДЕ Док.ВидНоменклатуры = &ВидНоменклатуры И Док.Приоритет = &Приоритет";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;	
		
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 29.12.2018
